Repository: python/pootle-python-org-backup
Catalog: tmxes/es/install.tmx
Source language: en
Languages: es

source: Installing Python Modules
es: Instalar módulos de Python

source: Author
es: Autor

source: Date
es: Fecha

source: Abstract
es: Resumen

source: This document describes the Python Distribution Utilities ("Distutils") from the end-user's point-of-view, describing how to extend the capabilities of a standard Python installation by building and installing third-party Python modules and extensions.
es: Este documento describe las Utilidades de Distribución de Python ("Distutils") desde el punto de vista del usuario final, describe cómo ampliar las capacidades de la instalación estándar de Python mediante la construcción e instalación de módulos y extensiones de terceros.

source: Introduction
es: Introducción

source: Although Python's extensive standard library covers many programming needs, there often comes a time when you need to add some new functionality to your Python installation in the form of third-party modules. This might be necessary to support your own programming, or to support an application that you want to use and that happens to be written in Python.
es: Aunque la extensa biblioteca estándar de Python cubre muchas necesidades de programación, a veces necesita añadir nueva funcionalidad a su instalación de Python mediante módulos de terceros. Por ejemplo, como apoyo a su propio desarrollo o para poder utilizar una aplicación que desee y esté escrita en Python.

source: In the past, there has been little support for adding third-party modules to an existing Python installation. With the introduction of the Python Distribution Utilities (Distutils for short) in Python 2.0, this changed.
es: En el pasado, ha habido poco soporte para añadir módulos de terceros a una instalación existente de Python. Mediante la introducción de las Utilidades de Distribución de Python (acortado a Distutils) en Python 2.0, esto ha cambiado.
